Edzelf/Basicmac-STM32WLE5/src/main.cpp
//***************************************************************************************************
//  Test program for SEEED Lora-E5 - Main program.                                                  *
//***************************************************************************************************
// OTAA mode:                                                                                       *
// On powerup, OTAA is used to join the network.  This will take about 34 seconds.  The TTN reply   *
// returns the (dynamic) keys that can be used to send the consecutive packets, just like ABP.      *
// The keys from TTN are saved in EEPROM for later use.                                             *
// The unit goes into deep sleep mode when a packet has been sent.                                  *
// After wake-up, ABP mode is used, using the dynamic keys from EEPROM.                             *
// This will take about 4 seconds.  After 300 packets send, a rejoin is made with OTAA.             *
// This is an escape in case the join gets broken (key lost at TTN, ...).                           *
// In deep sleep, the unit consumes 4 mA.  This is probably caused by the on-board USB chip.        *
//***************************************************************************************************
//                                                                                                  *
// Revision    Auth.  Remarks                                                                       *
// ----------  -----  ----------------------------------------------------------------------------- *
// 31-03-2023  ES     First set-up.                                                                 *
// 04-04-2023  ES     Most AU channels disabled.                                                    *
// 18-04-2023  ES     Version with modified basicmac.                                               *
// 20-04-2023  ES     Working ABP version including deep sleep mode.                                *
// 22-04-2023  ES     Working ABP and OTAA version including deep sleep mode.                       *
// 24-04-2023  ES     Enable 8 EU868 channels.                                                      *
//***************************************************************************************************
#include <Arduino.h>
#include <lmic.h>
#include <STM32RTC.h>
#include <STM32LowPower.h>
#include <EEPROM.h>                                       // Access to simulated EEPROM in Flash
#include <SPI.h>                                          // Needed for correct compilation

//***************************************************************************************************
// Configuration of end device.
#include "LoRa_Device_01.h"            // Definition for end device (Freq band, keys, ...)
//***************************************************************************************************


// Pin definitions.  The marking of the pins is strange.  Both the internal name and the marking
// on the module is listed in the following definition(s).
#define LED              PB5                              // LED is on PB5

// Data in RTC back-up registers
#define DATAVALID        67329752                         // Code for data valid (RTC and EEPROM)
#define BKP_R_DATAVALID  RTC_BKP_DR10                     // Position of data valid register
#define BKP_R_FCNT       RTC_BKP_DR11                     // Position of uplink frame counter
#define BKP_R_XMITCNT    RTC_BKP_DR12                     // Count number of transmits for rejoin

#define REJOIN_LIMIT     300                              // Rejoin after this number of transmits

#define DEBUG_BUFFER_SIZE 150                             // Max line length for debugging

// Data kept in EEPROM
struct eepromdata_t
{
  uint32_t datavalid ;                                    // Code for valid data
  uint32_t fcnt ;                                         // Uplink counter for ABP
  bool     joinedFlag ;                                   // If true: devaddr, nwkSKey and appSkey are valid
  uint32_t devaddr ;                                      // devaddr after OTAA join, from TTN
  uint8_t  nwkSKey[16] ;                                  // nwkSkey after OTAA join, from TTN
  uint8_t  appSKey[16] ;                                  // appSkey after OTAA join, from TTN
} ;


//**************************************************************************************************
// Local data.                                                                                     *
//**************************************************************************************************
static osjob_t    sendjob ;                               // Handle for send_packet
eepromdata_t      eepromdata ;                            // Data to and from EEPROM
STM32RTC&         rtc = STM32RTC::getInstance() ;         // Object for RTC clock (and RTC data)
bool              tx_finished = false ;                   // True if send finished
int32_t           xmitcount ;                             // Transmitcount from BKP register
bool              DEBUG = true ;                          // Allow debug using dbgprint()
#ifndef evnames                                           // Depends on lmic CFG_DEBUG
  const char* evnames[] =
        {
          "??", "SCAN_TIMEOUT", "BEACON_FOUND", "BEACON_MISSED", "BEACON_TRACKED",
          "JOINING", "JOINED", "RFU1", "JOIN_FAILED", "REJOIN_FAILED",
          "TXCOMPLETE (includes waiting for RX windows)",
          "LOST_TSYNC", "RESET", "RXCOMPLETE", "LINK_DEAD", "LINK_ALIVE",
          "SCAN_FOUND", "TXSTART", "TXDONE", "DATARATE", "START_SCAN", "ADR_BACKOFF"
        } ;
#endif

// Forward declarations:
char* get_rtc_time() ;                                    // Get current time


//**************************************************************************************************
//                                          D B G P R I N T                                        *
//**************************************************************************************************
// Send a line of info to serial output.  Works like vsprintf(), but checks the DEBUG flag.        *
// Print only if DEBUG flag is true.                                                               *
//**************************************************************************************************
void dbgprint ( const char* format, ... )
{
  static char sbuf[DEBUG_BUFFER_SIZE] ;                // For debug lines
  va_list varArgs ;                                    // For variable number of params

