Edzelf/Basicmac-STM32WLE5/src/main.cpp
  va_start ( varArgs, format ) ;                       // Prepare parameters
  vsnprintf ( sbuf, sizeof(sbuf), format, varArgs ) ;  // Format the message
  va_end ( varArgs ) ;                                 // End of using parameters
  if ( DEBUG )                                         // DEBUG on?
  {
    Serial.printf ( "%s - ",                           // Yes, print prefix (time of day)
                    get_rtc_time() + 9 ) ;             // Without 9 character date
    Serial.println ( sbuf ) ;                          // and the info
  }
}


//***************************************************************************************************
//                            C A L L B A C K S   F O R   O T A A                                   *
//***************************************************************************************************
// These callbacks are only used in over-the-air activation, not for ABP.                           *
//***************************************************************************************************
void os_getJoinEui (u1_t* buf)
{
  for ( int i = 0 ; i < 8 ; i++ )
  {
    buf [i] = JoinEui[7 - i] ;
  }
}

// This should also be in little endian format, see above.
void os_getDevEui (u1_t* buf)
{
  for ( int i = 0 ; i < 8 ; i++ )
  {
    {
      buf [i] = DevEui[7 - i] ;
    }
  }
}

// This key should be in big endian format (or, since it is not really a
// number but a block of memory, endianness does not really apply). In
// practice, a key taken from ttnctl can be copied as-is.
// The key shown here is the semtech default key.
void os_getNwkKey (u1_t* buf)
{
  memcpy ( buf, AppKey, 16 ) ;
}


// Return the region code used.  Will be called by LMIC_reset().
u1_t os_getRegion()
{
  return LMIC_regionCode ( LoraBand ) ;
}


//**************************************************************************************************
//                                R E A D E E P R O M D A T A                                      *
//**************************************************************************************************
// Read EEPROM data.                                                                               *
//**************************************************************************************************
void readEEPROMdata()
{
  uint8_t* p = (uint8_t*)&eepromdata ;                      // Set pointer to destination

  for ( int i = 0 ; i < sizeof(eepromdata_t) ; i++ )        // Fill destination
  {
    *p++ = EEPROM.read ( i ) ;                              // Copy one byte
  }
}


//**************************************************************************************************
//                                S A V E E E P R O M D A T A                                      *
//**************************************************************************************************
// Save EEPROM data.                                                                               *
//**************************************************************************************************
void saveEEPROMdata()
{
  uint8_t* p = (uint8_t*)&eepromdata ;                      // Set pointer to source

  for ( int i = 0 ; i < sizeof(eepromdata_t) ; i++ )        // Fill destination
  {
    EEPROM.update ( i, *p++ ) ;                             // Copy one byte
  }
}


//***************************************************************************************************
//                                   S A V E O T A A K E Y S                                        *
//***************************************************************************************************
// Save the TTN keys after join.  They can be used for subsequent transmits to TTN without the      *
// need to rejoin.                                                                                  *
//***************************************************************************************************
void saveOTAAkeys()
{
  eepromdata.devaddr = LMIC.devaddr ;                       // Save devaddr
  memcpy ( eepromdata.nwkSKey, LMIC.lceCtx.nwkSKey, 16 ) ; 	// Save nwkSkey
  memcpy ( eepromdata.appSKey, LMIC.lceCtx.appSKey, 16 ) ;  // Save appSKey
  eepromdata.joinedFlag = true ;                            // Join data is valid now
  saveEEPROMdata() ;                                        // Save in EEPROM
  dbgprint ( "OTAA join keys saved in EEPROM" ) ;
}


//***************************************************************************************************
//                                   S H O W O T A A K E Y S                                        *
//***************************************************************************************************
// Show the saved OTAA keys.                                                                        *
//***************************************************************************************************
void showOTAAkeys()
{
  char buf1[50] ;
  char buf2[50] ;

  for ( int j = 0 ; j < 16 ; j++ )
  {
    sprintf ( buf1 + j * 3, "%02X ", eepromdata.nwkSKey[j] ) ;
    sprintf ( buf2 + j * 3, "%02X ", eepromdata.appSKey[j] ) ;
  }
  dbgprint ( "LoRa devaddr is %08X", eepromdata.devaddr  ) ;
  dbgprint ( "LoRa nwkSKey is %s",  buf1 ) ;
  dbgprint ( "LoRa appSKey is %s",  buf2 ) ;
}


//***************************************************************************************************
//                                O N L M I C E V E N T                                             *
//***************************************************************************************************
// Handle events.                                                                                   *
//***************************************************************************************************
void onLmicEvent (ev_t ev)
{
    dbgprint ( "Event %s", evnames[ev] ) ;                            // Show name of event
    switch(ev)
    {
        case EV_JOINED:
            LMIC_setLinkCheckMode(0) ;
            break;
        case EV_TXDONE:
            break ;
        case EV_TXCOMPLETE:
            eepromdata.fcnt = LMIC.seqnoUp ;                          // Get uplink frame counter
            setBackupRegister ( BKP_R_FCNT,                           // Save reset count plus one
                                eepromdata.fcnt ) ;
            tx_finished = true ;                                      // Signal finished to main loop
            if (LMIC.txrxFlags & TXRX_ACK)
            {
              dbgprint ( "Received ack" ) ;
            }
            if ( LMIC.dataLen )
            {
              dbgprint ( "Received %d bytes of payload",
                         LMIC.dataLen ) ;
            }
            break;
         default:
            break;
    }
}


//***************************************************************************************************
//                                S E N D _ P A C K E T                                             *
//***************************************************************************************************
// Setup and send a new packet to TTN.                                                              *
// The uplink frame counter is saved in RTC memory (and sometimes EEPROM) after completion.         *
//***************************************************************************************************
void send_packet(osjob_t* j)
{
  char       payload[64] ;                                  // Test data

  if ( LMIC.opmode & OP_TXRXPEND )                          // Current TX/RX job running?
  {
    dbgprint ( "OP_TXRXPEND, not sending" ) ;           // Yes, show error
    return ;                                                // And leave
  }
  digitalWrite ( LED, LOW ) ;                               // Show activity
  sprintf ( payload, "Test %d", eepromdata.fcnt ) ;         // Format test packet
  dbgprint ( "Queue package '%s'", payload ) ;        // Show packet to send
  LMIC_setTxData2 ( 1, (u1_t*)payload,                      // Queue the packet
                    strlen ( payload ), 0 ) ;
  digitalWrite ( LED, HIGH ) ;                              // End of activity
  if ( ( eepromdata.fcnt % 100 ) == 0 )                     // 100 packets sent?
  {
    saveEEPROMdata() ;                                      // Yes, save frame counter in EEPROM
    dbgprint ( "fcnt saved in EEPROM" ) ;
  }
}


//**************************************************************************************************
//                                     S E T C H A N N E L S                                       *
//**************************************************************************************************
// Set channels to be used..                                                                       *
// Channels depend on frequency plan.                                                              *
//**************************************************************************************************
void setchannels()
{
  if ( LoraBand == REGION_EU868 )
  {
    dbgprint ( "LoRa configured for Europe 868 MHz" ) ;
  }
  if ( LoraBand == REGION_AU915 )
  {
    dbgprint ( "LoRa configured Australia/New Zealand 916.8 to 918.2 MHz" ) ;
    for ( int band = 0 ; band < 72 ; band++ )              // Disable/enable bands
    {
      if ( band < 8 || band > 15 )                         // Only leave bands 8..15
      {
        LMIC_disableChannel ( band ) ;                     // Disable others
      }
    }
  }                                                        // to get all the 8 channels
}


//***************************************************************************************************
//                          R E T R I E V E _ F C N T                                               *
//***************************************************************************************************
// Read RTC back-up registers and EEPROM to retrieve the LoRa uplink counter needed for ABP.        *                                                        *
//***************************************************************************************************
void retrieve_fcnt()
{
  uint32_t    bckVal ;                                      // Value from backup register
  bool        bckValid ;                                    // Data valid or not
  bool        savflag = false ;                             // EEPROM will be updated if true

  bckVal = getBackupRegister ( BKP_R_DATAVALID ) ;          // Get datavalid word
  bckValid = ( bckVal == DATAVALID ) ;                      // Set/reset valid flag
  EEPROM.begin() ;                                          // Enable EEPROM access
  readEEPROMdata() ;                                        // Read EEPROM data
  if ( eepromdata.datavalid != DATAVALID )                  // Valid data in EEPROM?
  {
    dbgprint ( "Data in EEPROM is invalid" ) ;              // No, show it
    eepromdata.datavalid = DATAVALID ;                      // Initialize EEPROM
    eepromdata.fcnt = 0 ;                                   // Count is unknown
    eepromdata.joinedFlag = false ;                         // Assume not joined
    savflag = true ;                                        // Save initialized data later
  }
  else
  {
    dbgprint ( "Data in EEPROM is valid, "                  // fcnt from EEPROM 100, 200, ...
                   "fcnt is %d", eepromdata.fcnt ) ;
    // The framecounter is saved in EEPROM only after every 100 packets in order to reduce wear-out.
    // So we make certain that the fcnt will be high enough.
    eepromdata.fcnt += 101 ;
  }
  if ( bckValid )                                           // Data in RTC memory is valid?
  {
    bckVal = getBackupRegister ( BKP_R_FCNT ) ;             // Yes, read fcnt from RTC memory
    xmitcount = getBackupRegister ( BKP_R_XMITCNT ) ;       // and xmit count
    dbgprint ( "Data in RTC is valid, "                     // And show
                   "fcnt is %d", bckVal  ) ;
    if ( bckVal > ( eepromdata.fcnt + 100 ) )               // Count in EEPROM lower than expected?
    {
      savflag = true ;                                      // Yes, set flag to update EEPROM
    }
    eepromdata.fcnt = bckVal ;                              // Use frame counter from RTC
  }
  else
  {
    dbgprint ( "Data in RTC is not valid" ) ;
    setBackupRegister ( BKP_R_DATAVALID, DATAVALID ) ;      // Invalid, write new data
    setBackupRegister ( BKP_R_FCNT, eepromdata.fcnt ) ;     // Insert uplink frame counter
    setBackupRegister ( BKP_R_XMITCNT, REJOIN_LIMIT ) ;     // Force rejoin
    xmitcount = REJOIN_LIMIT ;
  }
  if ( savflag )                                            // Data need to be saved?
  {
    saveEEPROMdata() ;                                      // Yes, update EEPROM
  }
  dbgprint ( "fcnt to be used for TTN is %d",               // Show final count
                 eepromdata.fcnt ) ;
}


//**************************************************************************************************
//                                  G E T _ R T C _ T I M E                                        *
//**************************************************************************************************
// Get a string with date and time.                                                                *
//**************************************************************************************************
char* get_rtc_time()
{
  static char tmbuf[64] ;                                   // For date and time as a string

  sprintf ( tmbuf, "%02d-%02d-%02d "                        // Format date
                   "%02d:%02d:%02d",                        // and time
                   rtc.getDay(),
                   rtc.getMonth(),
                   rtc.getYear(),
                   rtc.getHours(),
                   rtc.getMinutes(),
                   rtc.getSeconds() ) ;
  return tmbuf ;
}


//**************************************************************************************************
//                                  I N I T _ R T C _ C L O C K                                    *
//**************************************************************************************************
// Initialize the RTC.                                                                             *
// This is also needed to access the BCK registers.                                                *
//**************************************************************************************************
void init_rtc_clock()
{
  rtc.setClockSource ( STM32RTC::LSE_CLOCK ) ;  // LSI is default, use LSE
  rtc.begin() ;                                 // initialize RTC 24H format
  if ( ! rtc.isTimeSet() )                      // Time already set?
  {
    rtc.setHours   ( 0 ) ;                      // No, set the time
    rtc.setMinutes ( 0 ) ;
    rtc.setSeconds ( 0 ) ;
    rtc.setWeekDay ( 7 ) ;                      // and the date
    rtc.setDay     ( 1 ) ;
    rtc.setMonth   ( 1 ) ;
    rtc.setYear    ( 23 ) ;
  }
  enableBackupDomain() ;                        // Unlock to read/write back-up registers
}


//**************************************************************************************************
//                                     S E T U P                                                   *
//**************************************************************************************************
// Setup used peripherals and LoRa library.                                                        *
//**************************************************************************************************
void setup()
{
  unsigned    chan ;                                        // For channel selection

