Edzelf/Basicmac-STM32WLE5/src/main.cpp
  Serial.begin ( 115200 ) ;                                 // Start serial IO (RX2/TX2 = PA3,PA2)
  Serial.printf ( "\n" ) ;
  pinMode ( LED,           OUTPUT_OPEN_DRAIN ) ;            // Enable build-in LED
  init_rtc_clock() ;                                        // Initialize the RTC clock
  for ( int i = 0 ; i < 31 ; i++ )                          // Loop for 30 LED flashes
  {                                                         // end with LED off
    digitalToggle ( LED ) ;                                 // Turn LED on/off
    delay ( 100 ) ;                                         // Time to start serial monitor
  }
  dbgprint ( "Started at %s...",                            // Show alive message
                 get_rtc_time() ) ;
  os_init ( NULL ) ;                                        // Initialize lmic
  LMIC_reset() ;                                            // Reset the MAC state
  setchannels() ;                                           // Set LoRa channels
  retrieve_fcnt() ;                                         // Retrieve Uplink counter from RTC/EEPROM
  if ( LoraBand == REGION_AU915 )                           // Are we in NZ?
  {
    // Default setting is all channels 0..71 are enabled, but we want only 8..15
    for ( chan = 0 ; chan < 72 ; chan++ )                   // Disable most bands
    {
      if ( chan < 8 || chan > 15 )                          // Only leave bands 8..15
      {
        LMIC_disableChannel ( chan ) ;                      // Disable others
      }
    }
  }
  dbgprint ( "Start JOIN..." ) ;                            // For ABP this should be fast
  digitalWrite ( LED, LOW ) ;                               // Signal activity
  if ( JoinMode == JOINMODE_OTAA )                          // OTAA method?
  {
    dbgprint ( "xmitcount is %d", xmitcount ) ;
    if ( ( xmitcount < REJOIN_LIMIT ) &&                    // Yes, already joined?
         ( eepromdata.joinedFlag == true ) )
    {
      DevAddr = eepromdata.devaddr ;                        // Yes, use saved devadress and keys
      memcpy ( NwkSKey, eepromdata.nwkSKey, 16 ) ;
      memcpy ( AppSKey, eepromdata.appSKey, 16 ) ;
      setBackupRegister ( BKP_R_XMITCNT, ++xmitcount ) ;    // Update xmitcount in BKP register
      JoinMode = JOINMODE_ABP ;                             // Force ABP-mode
      dbgprint ( "OTAA join already made" ) ;               // Show for debug
    }
    else
    {
      dbgprint ( "Join with OTAA" ) ;                       // (Re)Join
      xmitcount = 0 ;                                       // Reset xmit counter
      setBackupRegister ( BKP_R_XMITCNT, xmitcount ) ;      // Save in RTC memory
      eepromdata.joinedFlag = false ;                       // Set to not joined
      saveEEPROMdata() ;                                    // Save in EEPROM
    }
  }
  if ( JoinMode == JOINMODE_ABP )
  {
    LMIC_setSession ( 0x1, DevAddr,
                      (const uint8_t*)NwkSKey,
                      (const uint8_t*)AppSKey ) ;
    LMIC.seqnoUp = eepromdata.fcnt ;                          // Set uplink frame counter
    dbgprint ( "ABP Framecount set to %d",
                   eepromdata.fcnt ) ;
    #if defined(CFG_eu868)
    // Set up the channels used by the Things Network, which corresponds
    // to the defaults of most gateways. Without this, only three base
    // channels from the LoRaWAN specification are used, which certainly
    // works, so it is good for debugging, but can overload those
    // frequencies, so be sure to configure the full frequency range of
    // your network here (unless your network autoconfigures them).
    // Setting up channels should happen after LMIC_setSession, as that
    // configures the minimal channel set.
    // NA-US channels 0-71 are configured automatically
    LMIC_setupChannel ( 0, 868100000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 1, 868300000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7B) ) ;     // g-band
    LMIC_setupChannel ( 2, 868500000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 3, 867100000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 4, 867300000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 5, 867500000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 6, 867700000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 7, 867900000, DR_RANGE_MAP(EU868_DR_SF12, EU868_DR_SF7) ) ;      // g-band
    LMIC_setupChannel ( 8, 868800000, DR_RANGE_MAP(EU868_DR_FSK,  EU868_DR_FSK) ) ;      // g2-band
    // TTN defines an additional channel at 869.525Mhz using SF9 for class B
    // devices' ping slots. LMIC does not have an easy way to define set this
    // frequency and support for class B is spotty and untested, so this
    // frequency is not configured here.
    #endif
  }
  digitalWrite ( LED, HIGH ) ;                                // End of activity
  send_packet ( &sendjob ) ;
}


//**************************************************************************************************
//                                       L O O P                                                   *
//**************************************************************************************************
// Main loop of the program.                                                                       *
//**************************************************************************************************
void loop()
{
  uint32_t sleeptime ;                                    // Computed time to sleep (msec)
  uint32_t sleeptime_sec ;                                // Sleeptime in seconds

  os_runstep() ;                                          // Keep lmic happy
  if ( tx_finished )                                      // Packet sent?
  {
    tx_finished = false ;
    if ( ! eepromdata.joinedFlag )                        // Need to write the EEPROM?
    {
      saveOTAAkeys() ;                                    // Yes, save the keys for later use
      showOTAAkeys() ;                                    // Show the keys
    }
    MODIFY_REG ( PWR->CR3, PWR_CR3_EWRFBUSY,              // Prevent radio busy interference with sleep
                 LL_PWR_RADIO_BUSY_TRIGGER_NONE ) ;
    sleeptime = tx_interval_sec * 1000 - millis() - 50 ;  // Compute sleep time
    sleeptime_sec = sleeptime / 1000 ;                    // Also in seconds
    if ( sleeptime_sec > tx_interval_sec )                // Run time > sleep time?
    {
      sleeptime = tx_interval_sec * 1000 ;                // Adjust to prevent a very long sleep
      sleeptime_sec = tx_interval_sec ;
    }
    dbgprint ( "Start deep sleep at %s for %d sec",       // Show go to sleep
                   get_rtc_time(), sleeptime_sec ) ;
    delay ( 50 ) ;                                        // Time to print last line
    LowPower.begin() ;                                    // Init low power mode
    LowPower.shutdown ( sleeptime ) ;                     // Sleep till next xmit interval
    while ( true ) {} ;                                   // Will not be executed
  }
}
